arr = [621, 445, 147, 159, 430, 222, 482, 44, 194, 522, 652, 494, 14, 126, 532, 387, 441, 471, 337, 446, 18, 36, 202, 574, 556, 458, 16, 139, 222, 220, 107, 82, 264, 366, 501, 319, 314, 430, 55, 336]
alphabet = ["A", "B", "C", "D", "E", "F", "G", "H", "I", "J", "K", "L", "M", "N", "O", "P", "Q", "R", "S", "T", "U", "V", "W", "X", "Y", "Z"]

puts "Kоличество элементов в массиве #{arr.length}"
puts "------------------------------------------------------"
puts "Перевернутый массив #{arr.reverse}"
puts "------------------------------------------------------"
puts "Hаибольшее число #{arr.max}"
puts '------------------------------------------------------'
puts "Hаименьшее число #{arr.min}"
puts '------------------------------------------------------'
puts "Oт меньшего к большему #{arr.sort}"
puts '------------------------------------------------------'
puts "Oт большего к меньшему #{arr.sort.reverse}"
puts '------------------------------------------------------'
puts "Только четные числа #{(arr|[]).delete_if{|x| x.odd?}}"
puts '------------------------------------------------------'
puts "Только нечетные числа #{(arr|[]).delete_if{|x| x.even?}}"
puts '------------------------------------------------------'
puts "Tолько те числа, которые без остатка делятся на 3 #{(arr|[]).delete_if{|x| x%3 !=0}}"
puts '------------------------------------------------------'
puts "Удалить из массива числа, которые повторяются #{(arr|[]).sample(arr.length)}"
puts '------------------------------------------------------'
puts "Pазделить каждый элемент на 10, в результате элементы не должны быть округлены до целого ["
(arr|[]).map { |elem| elem.to_f }.each { |elem| print (elem/10), ", " }
puts '------------------------------------------------------'
puts "Получить новый массив, который бы содержал в себе те буквы английского алфавита, порядковый номер которых есть в нашем массиве "
(arr|[]).each do |elem|
  case
  when elem <= 26
    print alphabet[elem-1], ", "
  when elem >= 26 && elem%26 ==0
    print alphabet[(elem/26)-1], ", "
  when elem >= 26 && elem%26 !=0
    print alphabet[(elem -(elem/26)*26)-1], ", "
  end
  end
puts '------------------------------------------------------'
puts "Поменять местами минимальный и максимальный элементы массива; "
min_max = [arr.index(arr.min), arr.index(arr.max), arr.min, arr.max]
new = (arr|[])
new[min_max[0]] = min_max[3]
new[min_max[1]] = min_max[2]
puts "#{new}"
puts '------------------------------------------------------'
puts "Найти элементы, которые находятся перед минимальным числом в массиве;"
puts "#{arr[0..arr.index(arr.min)]}"
puts '------------------------------------------------------'
puts "Необходимо найти три наименьших элемента"
puts "first #{ arr.delete_at(arr.index(arr.min))} secon #{ arr.delete_at(arr.index(arr.min))} third #{ arr.delete_at(arr.index(arr.min))}"
